*** src/convert.rs:116:17: replace < with == in decode

*** mutation diff:
--- src/convert.rs
+++ replace < with == in decode
@@ -108,17 +108,17 @@
         assert!(P >= B - 3, "P must be at least B - 3 to hold the payload");
     }
 
     // Prepare buffer for decoding base32.
     let mut data: Vec<u8, B> = Vec::new();
     let data_len = data_encoding::BASE32_NOPAD
         .decode_len(s.len())
         .map_err(|_| DecodeError::Invalid)?;
-    if data_len < 3 {
+    if data_len == /* ~ changed by cargo-mutants ~ */ 3 {
         return Err(DecodeError::Invalid);
     }
     data.resize_default(data_len)
         .map_err(|_| DecodeError::Invalid)?;
 
     // Decode base32.
     data_encoding::BASE32_NOPAD
         .decode_mut(s, &mut data)

---- test_public_key_ed25519_from_string_doesnt_panic stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'test_public_key_ed25519_from_string_doesnt_panic' (386466) panicked at src/convert.rs:128:15:
index out of bounds: the len is 0 but the index is 0
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-rs-stellar-strkey-noalloc-InVdqJ.tmp/tests/tests.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc f17f3ccf185c47e4cab3a39d1cf1badcb08d301606ba3c19a5044e66efe89055

thread 'test_public_key_ed25519_from_string_doesnt_panic' (386466) panicked at tests/tests.rs:626:1:
Test failed: index out of bounds: the len is 0 but

failures:
    test_public_key_ed25519_from_string_doesnt_panic

test result: FAILED. 21 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
