*** src/convert.rs:116:17: replace < with > in decode

*** mutation diff:
--- src/convert.rs
+++ replace < with > in decode
@@ -108,17 +108,17 @@
         assert!(P >= B - 3, "P must be at least B - 3 to hold the payload");
     }
 
     // Prepare buffer for decoding base32.
     let mut data: Vec<u8, B> = Vec::new();
     let data_len = data_encoding::BASE32_NOPAD
         .decode_len(s.len())
         .map_err(|_| DecodeError::Invalid)?;
-    if data_len < 3 {
+    if data_len > /* ~ changed by cargo-mutants ~ */ 3 {
         return Err(DecodeError::Invalid);
     }
     data.resize_default(data_len)
         .map_err(|_| DecodeError::Invalid)?;
 
     // Decode base32.
     data_encoding::BASE32_NOPAD
         .decode_mut(s, &mut data)

---- test_valid_contract stdout ----

thread 'test_valid_contract' (387232) panicked at tests/tests.rs:642:48:
called `Result::unwrap()` on an `Err` value: Invalid

---- test_valid_claimable_balance stdout ----

thread 'test_valid_claimable_balance' (387231) panicked at tests/tests.rs:642:48:
called `Result::unwrap()` on an `Err` value: Invalid

---- test_valid_hash_x stdout ----

thread 'test_valid_hash_x' (387233) panicked at tests/tests.rs:642:48:
called `Result::unwrap()` on an `Err` value: Invalid

failures:
    test_public_key_ed25519_from_string_doesnt_panic
    test_signed_payload_ed25519_payload_sizes
    test_valid_claimable_balance
    test_valid_contract
    test_valid_hash_x
    test_valid_liquidity_pool
    test_valid_muxed_ed25519
    test_valid_pre_auth_tx
    test_valid_private_keys
    test_valid_public_keys
    test_valid_signed_payload_ed25519

test result: FAILED. 11 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
