*** src/convert.rs:116:17: replace < with <= in decode

*** mutation diff:
--- src/convert.rs
+++ replace < with <= in decode
@@ -108,17 +108,17 @@
         assert!(P >= B - 3, "P must be at least B - 3 to hold the payload");
     }
 
     // Prepare buffer for decoding base32.
     let mut data: Vec<u8, B> = Vec::new();
     let data_len = data_encoding::BASE32_NOPAD
         .decode_len(s.len())
         .map_err(|_| DecodeError::Invalid)?;
-    if data_len < 3 {
+    if data_len <= /* ~ changed by cargo-mutants ~ */ 3 {
         return Err(DecodeError::Invalid);
     }
     data.resize_default(data_len)
         .map_err(|_| DecodeError::Invalid)?;
 
     // Decode base32.
     data_encoding::BASE32_NOPAD
         .decode_mut(s, &mut data)

*** result: Success
