*** src/convert.rs:12:21: replace + with * in binary_len

*** mutation diff:
--- src/convert.rs
+++ replace + with * in binary_len
@@ -4,17 +4,17 @@
 use heapless::{String, Vec};
 
 use crate::{crc::checksum, error::DecodeError};
 
 /// Calculates the binary length for a given payload length.
 ///
 /// The formula is `1 (version) + payload_len + 2 (checksum)`.
 pub const fn binary_len(payload_len: usize) -> usize {
-    1 + payload_len + 2
+    1 + payload_len * /* ~ changed by cargo-mutants ~ */ 2
 }
 
 /// Calculates the base32 (no padding) encoded length for a given binary length.
 ///
 /// The formula is `ceil(binary_len * 8 / 5)`.
 pub const fn encode_len(binary_len: usize) -> usize {
     (binary_len * 8 + 4) / 5
 }

error[E0080]: evaluation panicked: P must be at least B - 3 to hold the payload
   --> src/convert.rs:108:9
    |
108 |         assert!(P >= B - 3, "P must be at least B - 3 to hold the payload");
    |         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ evaluation of `convert::decode::<65, 32>::{constant#0}` failed here

error[E0080]: evaluation panicked: P must be at least B - 3 to hold the payload
   --> src/convert.rs:108:9
    |
108 |         assert!(P >= B - 3, "P must be at least B - 3 to hold the payload");
    |         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ evaluation of `convert::decode::<81, 40>::{constant#0}` failed here

*** result: Failure(101)
