*** src/convert.rs:12:5: replace binary_len -> usize with 0

*** mutation diff:
--- src/convert.rs
+++ replace binary_len -> usize with 0
@@ -4,17 +4,17 @@
 use heapless::{String, Vec};
 
 use crate::{crc::checksum, error::DecodeError};
 
 /// Calculates the binary length for a given payload length.
 ///
 /// The formula is `1 (version) + payload_len + 2 (checksum)`.
 pub const fn binary_len(payload_len: usize) -> usize {
-    1 + payload_len + 2
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Calculates the base32 (no padding) encoded length for a given binary length.
 ///
 /// The formula is `ceil(binary_len * 8 / 5)`.
 pub const fn encode_len(binary_len: usize) -> usize {
     (binary_len * 8 + 4) / 5
 }

error[E0080]: evaluation panicked: B must be at least 3 (1 version + 0 payload + 2 checksum)
  --> src/convert.rs:53:9
   |
53 | /         assert!(
54 | |             B >= 3,
55 | |             "B must be at least 3 (1 version + 0 payload + 2 checksum)"
56 | |         );
   | |_________^ evaluation of `convert::encode::<0, 0>::{constant#0}` failed here

error[E0080]: evaluation panicked: B must be at least 3 (1 version + 0 payload + 2 checksum)
   --> src/convert.rs:104:9
    |
104 | /         assert!(
105 | |             B >= 3,
106 | |             "B must be at least 3 (1 version + 0 payload + 2 checksum)"
107 | |         );
    | |_________^ evaluation of `convert::decode::<0, 32>::{constant#0}` failed here

*** result: Failure(101)
