*** src/convert.rs:132:65: replace - with + in decode

*** mutation diff:
--- src/convert.rs
+++ replace - with + in decode
@@ -124,17 +124,17 @@
         .decode_mut(s, &mut data)
         .map_err(|_| DecodeError::Invalid)?;
 
     // Unpack version.
     let ver = data[0];
 
     // Unpack and check checksum.
     let data_len = data.len();
-    let (data_without_crc, crc_actual) = data.split_at(data_len - 2);
+    let (data_without_crc, crc_actual) = data.split_at(data_len + /* ~ changed by cargo-mutants ~ */ 2);
     let crc_expect = checksum(data_without_crc);
     if crc_actual != crc_expect {
         return Err(DecodeError::Invalid);
     }
 
     // Unpack payload.
     // Safety: unwrap cannot fail because const assertion `P >= B - 3` ensures
     // P can hold any valid payload (payload_data.len() <= B - 3 <= P).

---- test_invalid_liquidity_pool stdout ----

thread 'test_invalid_liquidity_pool' (388747) panicked at src/convert.rs:132:47:
mid > len

---- test_invalid_pre_auth_tx stdout ----

thread 'test_invalid_pre_auth_tx' (388749) panicked at src/convert.rs:132:47:
mid > len

---- test_invalid_hash_x stdout ----

thread 'test_invalid_hash_x' (388746) panicked at src/convert.rs:132:47:
mid > len

failures:
    test_invalid_claimable_balances
    test_invalid_contract
    test_invalid_hash_x
    test_invalid_liquidity_pool
    test_invalid_muxed_ed25519
    test_invalid_pre_auth_tx
    test_invalid_private_keys
    test_invalid_public_keys
    test_invalid_signed_payload_ed25519
    test_signed_payload_ed25519_payload_sizes
    test_valid_claimable_balance
    test_valid_contract

test result: FAILED. 3 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
