*** src/convert.rs:134:19: replace != with == in decode

*** mutation diff:
--- src/convert.rs
+++ replace != with == in decode
@@ -126,17 +126,17 @@
 
     // Unpack version.
     let ver = data[0];
 
     // Unpack and check checksum.
     let data_len = data.len();
     let (data_without_crc, crc_actual) = data.split_at(data_len - 2);
     let crc_expect = checksum(data_without_crc);
-    if crc_actual != crc_expect {
+    if crc_actual == /* ~ changed by cargo-mutants ~ */ crc_expect {
         return Err(DecodeError::Invalid);
     }
 
     // Unpack payload.
     // Safety: unwrap cannot fail because const assertion `P >= B - 3` ensures
     // P can hold any valid payload (payload_data.len() <= B - 3 <= P).
     let payload_data = &data_without_crc[1..];
     let payload: Vec<u8, P> = Vec::from_slice(payload_data).unwrap();

---- test_invalid_muxed_ed25519 stdout ----

thread 'test_invalid_muxed_ed25519' (390270) panicked at tests/tests.rs:188:5:
assertion `left == right` failed
  left: Ok(MuxedAccountEd25519(MuxedAccount(3f0c34bf93ad0d9971d04ccc90f705511c838aad9734a4a2fb0d7a03fc7fe89a, 0)))
 right: Err(Invalid)

---- test_signed_payload_ed25519_payload_sizes stdout ----

thread 'test_signed_payload_ed25519_payload_sizes' (390277) panicked at tests/tests.rs:423:53:
called `Result::unwrap()` on an `Err` value: Invalid

---- test_valid_claimable_balance stdout ----

thread 'test_valid_claimable_balance' (390279) panicked at tests/tests.rs:642:48:
called `Result::unwrap()` on an `Err` value: Invalid

failures:
    test_invalid_muxed_ed25519
    test_signed_payload_ed25519_payload_sizes
    test_valid_claimable_balance
    test_valid_contract
    test_valid_hash_x
    test_valid_liquidity_pool
    test_valid_muxed_ed25519
    test_valid_pre_auth_tx
    test_valid_private_keys
    test_valid_public_keys
    test_valid_signed_payload_ed25519

test result: FAILED. 11 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
