*** src/convert.rs:19:5: replace encode_len -> usize with 1

*** mutation diff:
--- src/convert.rs
+++ replace encode_len -> usize with 1
@@ -11,17 +11,17 @@
 pub const fn binary_len(payload_len: usize) -> usize {
     1 + payload_len + 2
 }
 
 /// Calculates the base32 (no padding) encoded length for a given binary length.
 ///
 /// The formula is `ceil(binary_len * 8 / 5)`.
 pub const fn encode_len(binary_len: usize) -> usize {
-    (binary_len * 8 + 4) / 5
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 // Buffer sizes expected per strkey version:
 // +------------------------+-------------+------------+------------+
 // | Version                | Payload Len | Binary Len | Base32 Len |
 // +------------------------+-------------+------------+------------+
 // | PublicKeyEd25519       |          32 |         35 |         56 |
 // | PrivateKeyEd25519      |          32 |         35 |         56 |

error[E0080]: evaluation panicked: E must be at least ceil(B * 8 / 5) for base32 encoding
  --> src/convert.rs:58:9
   |
58 | /         assert!(
59 | |             E * 5 >= B * 8,
60 | |             "E must be at least ceil(B * 8 / 5) for base32 encoding"
61 | |         );
   | |_________^ evaluation of `convert::encode::<35, 1>::{constant#0}` failed here

error[E0080]: evaluation panicked: E must be at least ceil(B * 8 / 5) for base32 encoding
  --> src/convert.rs:58:9
   |
58 | /         assert!(
59 | |             E * 5 >= B * 8,
60 | |             "E must be at least ceil(B * 8 / 5) for base32 encoding"
61 | |         );
   | |_________^ evaluation of `convert::encode::<43, 1>::{constant#0}` failed here

*** result: Failure(101)
