*** src/convert.rs:52:5: replace encode -> String<E> with String::from(Default::default())

*** mutation diff:
--- src/convert.rs
+++ replace encode -> String<E> with String::from(Default::default())
@@ -44,42 +44,17 @@
 /// - `B` - Binary buffer capacity (must be ≥ 1 + payload.len() + 2)
 /// - `E` - Encoded output capacity (must be ≥ ceil(B * 8 / 5))
 ///
 /// # Panics
 ///
 /// Panics if the binary data exceeds `B` bytes or encoded output exceeds `E`
 /// bytes.
 pub fn encode<const B: usize, const E: usize>(ver: u8, payload: &[u8]) -> String<E> {
-    const {
-        assert!(
-            B >= 3,
-            "B must be at least 3 (1 version + 0 payload + 2 checksum)"
-        );
-        // E >= ceil(B * 8 / 5) is equivalent to E * 5 >= B * 8
-        assert!(
-            E * 5 >= B * 8,
-            "E must be at least ceil(B * 8 / 5) for base32 encoding"
-        );
-    }
-
-    // Build binary.
-    let mut d: Vec<u8, B> = Vec::new();
-    d.push(ver).unwrap();
-    d.extend_from_slice(payload).unwrap();
-    d.extend_from_slice(&checksum(&d)).unwrap();
-
-    // Encode as base32.
-    let mut encoded: Vec<u8, E> = Vec::new();
-    let encoded_len = data_encoding::BASE32_NOPAD.encode_len(d.len());
-    encoded.resize_default(encoded_len).unwrap();
-    data_encoding::BASE32_NOPAD.encode_mut(&d, &mut encoded);
-
-    // SAFETY: base32 encoding produces valid ASCII which is valid UTF-8
-    unsafe { String::from_utf8_unchecked(encoded) }
+    String::from(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes a base32 strkey string into a version byte and payload.
 ///
 /// The binary format is: `version (1 byte) || payload || checksum (2 bytes)`.
 ///
 /// # Generic Parameters
 ///

---- test_ed25519_muxed_account_display stdout ----

thread 'test_ed25519_muxed_account_display' (385556) panicked at tests/display.rs:162:5:
assertion `left == right` failed
  left: ""
 right: "MA3D5KRYM6CB7OWQ6TWYRR3Z4T7GNZLKERYNZGGA5SOAOPIFY6YQGAAAAAAAAAPCICBKU"

---- test_claimable_balance_display stdout ----

thread 'test_claimable_balance_display' (385554) panicked at tests/display.rs:243:5:
assertion `left == right` failed
  left: ""
 right: "BAADMPVKHBTYIH522D2O3CGHPHSP4ZXFNISHBXEYYDWJYBZ5AXD3CA3GDE"

---- test_ed25519_public_key_display stdout ----

thread 'test_ed25519_public_key_display' (385558) panicked at tests/display.rs:133:5:
assertion `left == right` failed
  left: ""
 right: "GA3D5KRYM6CB7OWQ6TWYRR3Z4T7GNZLKERYNZGGA5SOAOPIFY6YQHES5"

failures:
    test_claimable_balance_display
    test_contract_display
    test_ed25519_muxed_account_display
    test_ed25519_private_key_display
    test_ed25519_public_key_display
    test_ed25519_signed_payload_display
    test_hash_x_display
    test_liquidity_pool_display
    test_pre_auth_tx_display
    test_strkey_claimable_balance_display
    test_strkey_contract_display
    test_strkey_ed25519_muxed_account_display

test result: FAILED. 0 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
