*** src/convert.rs:12:7: replace + with * in binary_len

*** mutation diff:
--- src/convert.rs
+++ replace + with * in binary_len
@@ -4,17 +4,17 @@
 use heapless::{String, Vec};
 
 use crate::{crc::checksum, error::DecodeError};
 
 /// Calculates the binary length for a given payload length.
 ///
 /// The formula is `1 (version) + payload_len + 2 (checksum)`.
 pub const fn binary_len(payload_len: usize) -> usize {
-    1 + payload_len + 2
+    1 * /* ~ changed by cargo-mutants ~ */ payload_len + 2
 }
 
 /// Calculates the base32 (no padding) encoded length for a given binary length.
 ///
 /// The formula is `ceil(binary_len * 8 / 5)`.
 pub const fn encode_len(binary_len: usize) -> usize {
     (binary_len * 8 + 4) / 5
 }

---- test_contract_display stdout ----

thread 'test_contract_display' (395121) panicked at src/convert.rs:68:40:
called `Result::unwrap()` on an `Err` value: ()

---- test_ed25519_public_key_display stdout ----

thread 'test_ed25519_public_key_display' (395124) panicked at src/convert.rs:68:40:
called `Result::unwrap()` on an `Err` value: ()

---- test_ed25519_private_key_display stdout ----

thread 'test_ed25519_private_key_display' (395123) panicked at src/convert.rs:68:40:
called `Result::unwrap()` on an `Err` value: ()

failures:
    test_claimable_balance_display
    test_contract_display
    test_ed25519_muxed_account_display
    test_ed25519_private_key_display
    test_ed25519_public_key_display
    test_hash_x_display
    test_liquidity_pool_display
    test_pre_auth_tx_display
    test_strkey_claimable_balance_display
    test_strkey_contract_display
    test_strkey_ed25519_muxed_account_display
    test_strkey_ed25519_private_key_display

test result: FAILED. 2 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
