*** src/convert.rs:132:65: replace - with / in decode

*** mutation diff:
--- src/convert.rs
+++ replace - with / in decode
@@ -124,17 +124,17 @@
         .decode_mut(s, &mut data)
         .map_err(|_| DecodeError::Invalid)?;
 
     // Unpack version.
     let ver = data[0];
 
     // Unpack and check checksum.
     let data_len = data.len();
-    let (data_without_crc, crc_actual) = data.split_at(data_len - 2);
+    let (data_without_crc, crc_actual) = data.split_at(data_len / /* ~ changed by cargo-mutants ~ */ 2);
     let crc_expect = checksum(data_without_crc);
     if crc_actual != crc_expect {
         return Err(DecodeError::Invalid);
     }
 
     // Unpack payload.
     // Safety: unwrap cannot fail because const assertion `P >= B - 3` ensures
     // P can hold any valid payload (payload_data.len() <= B - 3 <= P).

---- test_signed_payload_ed25519_payload_sizes stdout ----

thread 'test_signed_payload_ed25519_payload_sizes' (402637) panicked at tests/tests.rs:423:53:
called `Result::unwrap()` on an `Err` value: Invalid

---- test_valid_claimable_balance stdout ----

thread 'test_valid_claimable_balance' (402639) panicked at tests/tests.rs:642:48:
called `Result::unwrap()` on an `Err` value: Invalid

---- test_valid_contract stdout ----

thread 'test_valid_contract' (402640) panicked at tests/tests.rs:642:48:
called `Result::unwrap()` on an `Err` value: Invalid

failures:
    test_signed_payload_ed25519_payload_sizes
    test_valid_claimable_balance
    test_valid_contract
    test_valid_hash_x
    test_valid_liquidity_pool
    test_valid_muxed_ed25519
    test_valid_pre_auth_tx
    test_valid_private_keys
    test_valid_public_keys
    test_valid_signed_payload_ed25519

test result: FAILED. 12 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
