*** src/convert.rs:19:21: replace + with * in encode_len

*** mutation diff:
--- src/convert.rs
+++ replace + with * in encode_len
@@ -11,17 +11,17 @@
 pub const fn binary_len(payload_len: usize) -> usize {
     1 + payload_len + 2
 }
 
 /// Calculates the base32 (no padding) encoded length for a given binary length.
 ///
 /// The formula is `ceil(binary_len * 8 / 5)`.
 pub const fn encode_len(binary_len: usize) -> usize {
-    (binary_len * 8 + 4) / 5
+    (binary_len * 8 * /* ~ changed by cargo-mutants ~ */ 4) / 5
 }
 
 // Buffer sizes expected per strkey version:
 // +------------------------+-------------+------------+------------+
 // | Version                | Payload Len | Binary Len | Base32 Len |
 // +------------------------+-------------+------------+------------+
 // | PublicKeyEd25519       |          32 |         35 |         56 |
 // | PrivateKeyEd25519      |          32 |         35 |         56 |

---- convert::tests::test_encode_len_matches_data_encoding stdout ----

thread 'convert::tests::test_encode_len_matches_data_encoding' (397070) panicked at src/convert.rs:158:13:
assertion `left == right` failed: encode_len mismatch for payload_len=32, binary_len=35: expected 56, got 224
  left: 224
 right: 56

failures:
    convert::tests::test_encode_len_matches_data_encoding

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
